---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
source: html/2a5e5565-9ed4-ebbc-13e1-c13a0b1ffc22.htm
---
# StructuralSectionGeneralCEx Properties

Common set of parameters for structural analysis.